<details>
<summary>Execution result of "run-all plan" in "infrastructure/aws"</summary>

```terraform
19:04:30.678 INFO   The stack at /github/workspace/infrastructure/aws will be processed in the following order for command plan:
Group 1
- Module management/north-virginia/aws_accounts/playground
- Module management/north-virginia/aws_organization
- Module management/north-virginia/vpc


19:04:30.852 INFO   [management/north-virginia/aws_accounts/playground] Downloading Terraform configurations from file:///github/workspace/modules/aws/aws_account into /github/workspace/infrastructure/aws/management/north-virginia/aws_accounts/playground/.terragrunt-cache/pamcXYsh7Pqpp5BrO4tFjqhSqzs/10o_Yfon3CbB0MLOTJl69oEly1g
19:04:30.853 INFO   [management/north-virginia/vpc] Downloading Terraform configurations from git::https://github.com/terraform-aws-modules/terraform-aws-vpc.git into /github/workspace/infrastructure/aws/management/north-virginia/vpc/.terragrunt-cache/tN8aN2Wrm1ax0JOoNGxYDj4UZc8/A35GeYiqYDYXDWZftKtd1kkU5ic
19:04:30.863 INFO   [management/north-virginia/aws_organization] Downloading Terraform configurations from file:///github/workspace/modules/aws/aws_organization into /github/workspace/infrastructure/aws/management/north-virginia/aws_organization/.terragrunt-cache/BmOb26uR7vqlaJoMBL_XANu2c6k/kLn2nKw80j_MBMKRZUlBCyiMAms
19:04:31.202 STDOUT [management/north-virginia/aws_accounts/playground] tofu: Initializing the backend...
19:04:31.208 STDOUT [management/north-virginia/aws_organization] tofu: Initializing the backend...
19:04:31.325 STDOUT [management/north-virginia/aws_organization] tofu: 
19:04:31.325 STDOUT [management/north-virginia/aws_organization] tofu: Successfully configured the backend "s3"! OpenTofu will automatically
19:04:31.325 STDOUT [management/north-virginia/aws_organization] tofu: use this backend unless the backend configuration changes.
19:04:31.331 STDOUT [management/north-virginia/vpc] tofu: Initializing the backend...
19:04:31.350 STDOUT [management/north-virginia/aws_accounts/playground] tofu: 
19:04:31.350 STDOUT [management/north-virginia/aws_accounts/playground] tofu: Successfully configured the backend "s3"! OpenTofu will automatically
19:04:31.350 STDOUT [management/north-virginia/aws_accounts/playground] tofu: use this backend unless the backend configuration changes.
19:04:31.406 STDOUT [management/north-virginia/aws_accounts/playground] tofu: Initializing provider plugins...
19:04:31.406 STDOUT [management/north-virginia/aws_accounts/playground] tofu: - Finding hashicorp/aws versions matching ">= 4.0.0"...
19:04:31.420 STDOUT [management/north-virginia/aws_organization] tofu: Initializing provider plugins...
19:04:31.420 STDOUT [management/north-virginia/aws_organization] tofu: - Finding hashicorp/aws versions matching ">= 4.0.0"...
19:04:31.423 STDOUT [management/north-virginia/vpc] tofu: 
19:04:31.423 STDOUT [management/north-virginia/vpc] tofu: Successfully configured the backend "s3"! OpenTofu will automatically
19:04:31.423 STDOUT [management/north-virginia/vpc] tofu: use this backend unless the backend configuration changes.
19:04:31.597 STDOUT [management/north-virginia/aws_organization] tofu: - Installing hashicorp/aws v5.93.0...
19:04:31.626 STDOUT [management/north-virginia/vpc] tofu: Initializing provider plugins...
19:04:31.626 STDOUT [management/north-virginia/vpc] tofu: - Finding hashicorp/aws versions matching ">= 5.79.0"...
19:04:31.772 STDOUT [management/north-virginia/aws_accounts/playground] tofu: - Installing hashicorp/aws v5.93.0...
19:04:31.951 STDOUT [management/north-virginia/vpc] tofu: - Installing hashicorp/aws v5.93.0...
19:04:36.542 STDOUT [management/north-virginia/vpc] tofu: - Installed hashicorp/aws v5.93.0 (signed, key ID 0C0AF313E5FD9F80)
19:04:36.542 STDOUT [management/north-virginia/vpc] tofu: Providers are signed by their developers.
19:04:36.542 STDOUT [management/north-virginia/vpc] tofu: If you'd like to know more about provider signing, you can read about it here:
19:04:36.542 STDOUT [management/north-virginia/vpc] tofu: https://opentofu.org/docs/cli/plugins/signing/
19:04:36.542 STDOUT [management/north-virginia/vpc] tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
19:04:36.542 STDOUT [management/north-virginia/vpc] tofu: selections it made above. Include this file in your version control repository
19:04:36.542 STDOUT [management/north-virginia/vpc] tofu: so that OpenTofu can guarantee to make the same selections by default when
19:04:36.542 STDOUT [management/north-virginia/vpc] tofu: you run "tofu init" in the future.
19:04:36.542 STDOUT [management/north-virginia/vpc] tofu: OpenTofu has been successfully initialized!
19:04:37.027 STDOUT [management/north-virginia/aws_organization] tofu: - Installed hashicorp/aws v5.93.0 (signed, key ID 0C0AF313E5FD9F80)
19:04:37.027 STDOUT [management/north-virginia/aws_organization] tofu: Providers are signed by their developers.
19:04:37.027 STDOUT [management/north-virginia/aws_organization] tofu: If you'd like to know more about provider signing, you can read about it here:
19:04:37.027 STDOUT [management/north-virginia/aws_organization] tofu: https://opentofu.org/docs/cli/plugins/signing/
19:04:37.027 STDOUT [management/north-virginia/aws_organization] tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
19:04:37.027 STDOUT [management/north-virginia/aws_organization] tofu: selections it made above. Include this file in your version control repository
19:04:37.027 STDOUT [management/north-virginia/aws_organization] tofu: so that OpenTofu can guarantee to make the same selections by default when
19:04:37.027 STDOUT [management/north-virginia/aws_organization] tofu: you run "tofu init" in the future.
19:04:37.027 STDOUT [management/north-virginia/aws_organization] tofu: OpenTofu has been successfully initialized!
19:04:37.095 STDOUT [management/north-virginia/aws_accounts/playground] tofu: - Installed hashicorp/aws v5.93.0 (signed, key ID 0C0AF313E5FD9F80)
19:04:37.095 STDOUT [management/north-virginia/aws_accounts/playground] tofu: Providers are signed by their developers.
19:04:37.095 STDOUT [management/north-virginia/aws_accounts/playground] tofu: If you'd like to know more about provider signing, you can read about it here:
19:04:37.095 STDOUT [management/north-virginia/aws_accounts/playground] tofu: https://opentofu.org/docs/cli/plugins/signing/
19:04:37.095 STDOUT [management/north-virginia/aws_accounts/playground] tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
19:04:37.095 STDOUT [management/north-virginia/aws_accounts/playground] tofu: selections it made above. Include this file in your version control repository
19:04:37.095 STDOUT [management/north-virginia/aws_accounts/playground] tofu: so that OpenTofu can guarantee to make the same selections by default when
19:04:37.095 STDOUT [management/north-virginia/aws_accounts/playground] tofu: you run "tofu init" in the future.
19:04:37.095 STDOUT [management/north-virginia/aws_accounts/playground] tofu: OpenTofu has been successfully initialized!
19:04:40.806 STDOUT [management/north-virginia/vpc] tofu: No changes. Your infrastructure matches the configuration.
19:04:40.806 STDOUT [management/north-virginia/vpc] tofu: OpenTofu has compared your real infrastructure against your configuration and
19:04:40.806 STDOUT [management/north-virginia/vpc] tofu: found no differences, so no changes are needed.
19:04:40.914 STDOUT [management/north-virginia/aws_accounts/playground] tofu: OpenTofu used the selected providers to generate the following execution
19:04:40.914 STDOUT [management/north-virginia/aws_accounts/playground] tofu: plan. Resource actions are indicated with the following symbols:
19:04:40.914 STDOUT [management/north-virginia/aws_accounts/playground] tofu:   + create
19:04:40.914 STDOUT [management/north-virginia/aws_accounts/playground] tofu: OpenTofu will perform the following actions:
19:04:40.914 STDOUT [management/north-virginia/aws_accounts/playground] tofu:   # aws_organizations_account.account will be created
19:04:40.914 STDOUT [management/north-virginia/aws_accounts/playground] tofu:   + resource "aws_organizations_account" "account" {
19:04:40.914 STDOUT [management/north-virginia/aws_accounts/playground] tofu:       + arn               = (known after apply)
19:04:40.914 STDOUT [management/north-virginia/aws_accounts/playground] tofu:       + close_on_deletion = false
19:04:40.914 STDOUT [management/north-virginia/aws_accounts/playground] tofu:       + create_govcloud   = false
19:04:40.914 STDOUT [management/north-virginia/aws_accounts/playground] tofu:       + email             = "yashraj.dighe077+aws-playground@gmail.com"
19:04:40.914 STDOUT [management/north-virginia/aws_accounts/playground] tofu:       + govcloud_id       = (known after apply)
19:04:40.914 STDOUT [management/north-virginia/aws_accounts/playground] tofu:       + id                = (known after apply)
19:04:40.914 STDOUT [management/north-virginia/aws_accounts/playground] tofu:       + joined_method     = (known after apply)
19:04:40.914 STDOUT [management/north-virginia/aws_accounts/playground] tofu:       + joined_timestamp  = (known after apply)
19:04:40.914 STDOUT [management/north-virginia/aws_accounts/playground] tofu:       + name              = "playground"
19:04:40.914 STDOUT [management/north-virginia/aws_accounts/playground] tofu:       + parent_id         = (known after apply)
19:04:40.914 STDOUT [management/north-virginia/aws_accounts/playground] tofu:       + role_name         = "OrganizationAccountAccessRole"
19:04:40.914 STDOUT [management/north-virginia/aws_accounts/playground] tofu:       + status            = (known after apply)
19:04:40.914 STDOUT [management/north-virginia/aws_accounts/playground] tofu:       + tags_all          = {
19:04:40.914 STDOUT [management/north-virginia/aws_accounts/playground] tofu:           + "creator"     = "terraform/terragrunt"
19:04:40.914 STDOUT [management/north-virginia/aws_accounts/playground] tofu:           + "environment" = "management"
19:04:40.914 STDOUT [management/north-virginia/aws_accounts/playground] tofu:           + "platform"    = "aws"
19:04:40.914 STDOUT [management/north-virginia/aws_accounts/playground] tofu:           + "project"     = "iac"
19:04:40.914 STDOUT [management/north-virginia/aws_accounts/playground] tofu:           + "team"        = "devops"
19:04:40.914 STDOUT [management/north-virginia/aws_accounts/playground] tofu:         }
19:04:40.914 STDOUT [management/north-virginia/aws_accounts/playground] tofu:     }
19:04:40.914 STDOUT [management/north-virginia/aws_accounts/playground] tofu: Plan: 1 to add, 0 to change, 0 to destroy.
19:04:40.914 STDOUT [management/north-virginia/aws_accounts/playground] tofu: 
19:04:40.914 STDOUT [management/north-virginia/aws_accounts/playground] tofu: Changes to Outputs:
19:04:40.914 STDOUT [management/north-virginia/aws_accounts/playground] tofu:   + account_arn            = (known after apply)
19:04:40.914 STDOUT [management/north-virginia/aws_accounts/playground] tofu:   + account_id             = (known after apply)
19:04:40.914 STDOUT [management/north-virginia/aws_accounts/playground] tofu:   + organization_role_name = "OrganizationAccountAccessRole"
19:04:40.937 STDOUT [management/north-virginia/aws_organization] tofu: aws_organizations_organization.org: Refreshing state... [id=o-4s1jxdnpu3]
19:04:41.500 STDOUT [management/north-virginia/aws_organization] tofu: No changes. Your infrastructure matches the configuration.
19:04:41.500 STDOUT [management/north-virginia/aws_organization] tofu: OpenTofu has compared your real infrastructure against your configuration and
19:04:41.500 STDOUT [management/north-virginia/aws_organization] tofu: found no differences, so no changes are needed.
```

</details>
    
